name: "lNet"

layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param {
    shape: {
      dim: 1
      dim: 15
      dim: 24
      dim: 24
    }
  }
}
layer {
  name: "slicer_data"
  type: "Slice"
  bottom: "data"
  top: "data_1"
  top: "data_2"
  top: "data_3"
  top: "data_4"
  top: "data_5"
  slice_param {
    axis: 1
    slice_point: 3
    slice_point: 6
    slice_point: 9
    slice_point: 12
  }
}

######## net-1 ########
layer {
  name: "conv1_1"
  type: "Convolution"
  bottom: "data_1"
  top: "conv1_1"
  convolution_param {
    num_output: 28
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "prelu1_1"
  type: "PReLU"
  bottom: "conv1_1"
  top: "conv1_1"
}
layer {
  name: "pool1_1"
  type: "Pooling"
  bottom: "conv1_1"
  top: "pool1_1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "conv2_1"
  type: "Convolution"
  bottom: "pool1_1"
  top: "conv2_1"
  convolution_param {
    num_output: 48
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "prelu2_1"
  type: "PReLU"
  bottom: "conv2_1"
  top: "conv2_1"
}
layer {
  name: "pool2_1"
  type: "Pooling"
  bottom: "conv2_1"
  top: "pool2_1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "conv3_1"
  type: "Convolution"
  bottom: "pool2_1"
  top: "conv3_1"
  convolution_param {
    num_output: 64
    kernel_size: 2
    stride: 1
  }
}
layer {
  name: "prelu3_1"
  type: "PReLU"
  bottom: "conv3_1"
  top: "conv3_1"
}

######## net-2 ########
layer {
  name: "conv1_2"
  type: "Convolution"
  bottom: "data_2"
  top: "conv1_2"
  convolution_param {
    num_output: 28
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "prelu1_2"
  type: "PReLU"
  bottom: "conv1_2"
  top: "conv1_2"
}
layer {
  name: "pool1_2"
  type: "Pooling"
  bottom: "conv1_2"
  top: "pool1_2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "conv2_2"
  type: "Convolution"
  bottom: "pool1_2"
  top: "conv2_2"
  convolution_param {
    num_output: 48
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "prelu2_2"
  type: "PReLU"
  bottom: "conv2_2"
  top: "conv2_2"
}
layer {
  name: "pool2_2"
  type: "Pooling"
  bottom: "conv2_2"
  top: "pool2_2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "conv3_2"
  type: "Convolution"
  bottom: "pool2_2"
  top: "conv3_2"
  convolution_param {
    num_output: 64
    kernel_size: 2
    stride: 1
  }
}
layer {
  name: "prelu3_2"
  type: "PReLU"
  bottom: "conv3_2"
  top: "conv3_2"
}

######## net-3 ########
layer {
  name: "conv1_3"
  type: "Convolution"
  bottom: "data_3"
  top: "conv1_3"
  convolution_param {
    num_output: 28
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "prelu1_3"
  type: "PReLU"
  bottom: "conv1_3"
  top: "conv1_3"
}
layer {
  name: "pool1_3"
  type: "Pooling"
  bottom: "conv1_3"
  top: "pool1_3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "conv2_3"
  type: "Convolution"
  bottom: "pool1_3"
  top: "conv2_3"
  convolution_param {
    num_output: 48
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "prelu2_3"
  type: "PReLU"
  bottom: "conv2_3"
  top: "conv2_3"
}
layer {
  name: "pool2_3"
  type: "Pooling"
  bottom: "conv2_3"
  top: "pool2_3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "conv3_3"
  type: "Convolution"
  bottom: "pool2_3"
  top: "conv3_3"
  convolution_param {
    num_output: 64
    kernel_size: 2
    stride: 1
  }
}
layer {
  name: "prelu3_3"
  type: "PReLU"
  bottom: "conv3_3"
  top: "conv3_3"
}

######## net-4 ########
layer {
  name: "conv1_4"
  type: "Convolution"
  bottom: "data_4"
  top: "conv1_4"
  convolution_param {
    num_output: 28
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "prelu1_4"
  type: "PReLU"
  bottom: "conv1_4"
  top: "conv1_4"
}
layer {
  name: "pool1_4"
  type: "Pooling"
  bottom: "conv1_4"
  top: "pool1_4"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "conv2_4"
  type: "Convolution"
  bottom: "pool1_4"
  top: "conv2_4"
  convolution_param {
    num_output: 48
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "prelu2_4"
  type: "PReLU"
  bottom: "conv2_4"
  top: "conv2_4"
}
layer {
  name: "pool2_4"
  type: "Pooling"
  bottom: "conv2_4"
  top: "pool2_4"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "conv3_4"
  type: "Convolution"
  bottom: "pool2_4"
  top: "conv3_4"
  convolution_param {
    num_output: 64
    kernel_size: 2
    stride: 1
  }
}
layer {
  name: "prelu3_4"
  type: "PReLU"
  bottom: "conv3_4"
  top: "conv3_4"
}

######## net-5 ########
layer {
  name: "conv1_5"
  type: "Convolution"
  bottom: "data_5"
  top: "conv1_5"
  convolution_param {
    num_output: 28
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "prelu1_5"
  type: "PReLU"
  bottom: "conv1_5"
  top: "conv1_5"
}
layer {
  name: "pool1_5"
  type: "Pooling"
  bottom: "conv1_5"
  top: "pool1_5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "conv2_5"
  type: "Convolution"
  bottom: "pool1_5"
  top: "conv2_5"
  convolution_param {
    num_output: 48
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "prelu2_5"
  type: "PReLU"
  bottom: "conv2_5"
  top: "conv2_5"
}
layer {
  name: "pool2_5"
  type: "Pooling"
  bottom: "conv2_5"
  top: "pool2_5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "conv3_5"
  type: "Convolution"
  bottom: "pool2_5"
  top: "conv3_5"
  convolution_param {
    num_output: 64
    kernel_size: 2
    stride: 1
  }
}
layer {
  name: "prelu3_5"
  type: "PReLU"
  bottom: "conv3_5"
  top: "conv3_5"
}

######## concat ########
layer {
  name: "concat"
  type: "Concat"
  bottom: "conv3_1"
  bottom: "conv3_2"
  bottom: "conv3_3"
  bottom: "conv3_4"
  bottom: "conv3_5"
  top: "concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "fc4"
  type: "InnerProduct"
  bottom: "concat"
  top: "fc4"
  inner_product_param {
    num_output: 256
  }
}
layer {
  name: "prelu4"
  type: "PReLU"
  bottom: "fc4"
  top: "fc4"
}

######## net-1 output ########
layer {
  name: "fc5_1"
  type: "InnerProduct"
  bottom: "fc4"
  top: "fc5_1"
  inner_product_param {
    num_output: 64
  }
}
layer {
  name: "prelu5_1"
  type: "PReLU"
  bottom: "fc5_1"
  top: "fc5_1"
}

layer {
  name: "fc6_1"
  type: "InnerProduct"
  bottom: "fc5_1"
  top: "fc6_1"
  inner_product_param {
    num_output: 2
  }
}

######## net-2 output ########
layer {
  name: "fc5_2"
  type: "InnerProduct"
  bottom: "fc4"
  top: "fc5_2"
  inner_product_param {
    num_output: 64
  }
}
layer {
  name: "prelu5_2"
  type: "PReLU"
  bottom: "fc5_2"
  top: "fc5_2"
}

layer {
  name: "fc6_2"
  type: "InnerProduct"
  bottom: "fc5_2"
  top: "fc6_2"
  inner_product_param {
    num_output: 2
  }
}

######## net-3 output ########
layer {
  name: "fc5_3"
  type: "InnerProduct"
  bottom: "fc4"
  top: "fc5_3"
  inner_product_param {
    num_output: 64
  }
}
layer {
  name: "prelu5_3"
  type: "PReLU"
  bottom: "fc5_3"
  top: "fc5_3"
}

layer {
  name: "fc6_3"
  type: "InnerProduct"
  bottom: "fc5_3"
  top: "fc6_3"
  inner_product_param {
    num_output: 2
  }
}

######## net-4 output ########
layer {
  name: "fc5_4"
  type: "InnerProduct"
  bottom: "fc4"
  top: "fc5_4"
  inner_product_param {
    num_output: 64
  }
}
layer {
  name: "prelu5_4"
  type: "PReLU"
  bottom: "fc5_4"
  top: "fc5_4"
}

layer {
  name: "fc6_4"
  type: "InnerProduct"
  bottom: "fc5_4"
  top: "fc6_4"
  inner_product_param {
    num_output: 2
  }
}

######## net-5 output ########
layer {
  name: "fc5_5"
  type: "InnerProduct"
  bottom: "fc4"
  top: "fc5_5"
  inner_product_param {
    num_output: 64
  }
}
layer {
  name: "prelu5_5"
  type: "PReLU"
  bottom: "fc5_5"
  top: "fc5_5"
}

layer {
  name: "fc6_5"
  type: "InnerProduct"
  bottom: "fc5_5"
  top: "fc6_5"
  inner_product_param {
    num_output: 2
  }
}
