name: "lNet"

layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param {
    shape: {
      dim: 1
      dim: 15
      dim: 24
      dim: 24
    }
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 50
    group: 5
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "prelu1"
  type: "PReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  convolution_param {
    num_output: 100
    group: 5
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "prelu2"
  type: "PReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
  convolution_param {
    num_output: 200
    group: 5
    kernel_size: 2
    stride: 1
  }
}
layer {
  name: "prelu3"
  type: "PReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "fc4"
  type: "InnerProduct"
  bottom: "conv3"
  top: "fc4"
  inner_product_param {
    num_output: 256
  }
}
layer {
  name: "prelu4"
  type: "PReLU"
  bottom: "fc4"
  top: "fc4"
}
######## net-1 output ########
layer {
  name: "fc5_1"
  type: "InnerProduct"
  bottom: "fc4"
  top: "fc5_1"
  inner_product_param {
    num_output: 64
  }
}
layer {
  name: "prelu5_1"
  type: "PReLU"
  bottom: "fc5_1"
  top: "fc5_1"
}
layer {
  name: "fc6_1"
  type: "InnerProduct"
  bottom: "fc5_1"
  top: "fc6_1"
  inner_product_param {
    num_output: 2
  }
}
######## net-2 output ########
layer {
  name: "fc5_2"
  type: "InnerProduct"
  bottom: "fc4"
  top: "fc5_2"
  inner_product_param {
    num_output: 64
  }
}
layer {
  name: "prelu5_2"
  type: "PReLU"
  bottom: "fc5_2"
  top: "fc5_2"
}
layer {
  name: "fc6_2"
  type: "InnerProduct"
  bottom: "fc5_2"
  top: "fc6_2"
  inner_product_param {
    num_output: 2
  }
}
######## net-3 output ########
layer {
  name: "fc5_3"
  type: "InnerProduct"
  bottom: "fc4"
  top: "fc5_3"
  inner_product_param {
    num_output: 64
  }
}
layer {
  name: "prelu5_3"
  type: "PReLU"
  bottom: "fc5_3"
  top: "fc5_3"
}
layer {
  name: "fc6_3"
  type: "InnerProduct"
  bottom: "fc5_3"
  top: "fc6_3"
  inner_product_param {
    num_output: 2
  }
}
######## net-4 output ########
layer {
  name: "fc5_4"
  type: "InnerProduct"
  bottom: "fc4"
  top: "fc5_4"
  inner_product_param {
    num_output: 64
  }
}
layer {
  name: "prelu5_4"
  type: "PReLU"
  bottom: "fc5_4"
  top: "fc5_4"
}
layer {
  name: "fc6_4"
  type: "InnerProduct"
  bottom: "fc5_4"
  top: "fc6_4"
  inner_product_param {
    num_output: 2
  }
}
######## net-5 output ########
layer {
  name: "fc5_5"
  type: "InnerProduct"
  bottom: "fc4"
  top: "fc5_5"
  inner_product_param {
    num_output: 64
  }
}
layer {
  name: "prelu5_5"
  type: "PReLU"
  bottom: "fc5_5"
  top: "fc5_5"
}
layer {
  name: "fc6_5"
  type: "InnerProduct"
  bottom: "fc5_5"
  top: "fc6_5"
  inner_product_param {
    num_output: 2
  }
}

######## final output ########
layer {
  name: "landmark_offset"
  type: "Concat"
  bottom: "fc6_1"
  bottom: "fc6_2"
  bottom: "fc6_3"
  bottom: "fc6_4"
  bottom: "fc6_5"
  top: "landmark_offset"
  concat_param {
    axis: 1
  }
}
