name: "pnet"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param {
    shape: {
      dim: 1
      dim: 3
      dim: 12
      dim: 12
    }
  }
}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 10
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}

layer {
  name: "conv3"
  type: "Convolution"
  bottom: "conv2"
  top: "conv3"
  convolution_param {
    num_output: 32
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}

# face label
layer {
  name: "face_label"
  type: "Convolution"
  bottom: "conv3"
  top: "face_label"
  convolution_param {
    num_output: 2
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "face_prob"
  type: "Softmax"
  bottom: "face_label"
  top: "face_prob"
  softmax_param {
    axis: 1
  }
}
# face bbox
layer {
  name: "face_bbox"
  type: "Convolution"
  bottom: "conv3"
  top: "face_bbox"
  convolution_param {
    num_output: 3
    kernel_size: 1
    stride: 1
  }
}
# face landmark
layer {
  name: "face_landmark"
  type: "Convolution"
  bottom: "conv3"
  top: "face_landmark"
  convolution_param {
    num_output: 10
    kernel_size: 1
    stride: 1
  }
}
