name: "pNet"
layer {
  name: "data"
  type: "Python"
  top: "data"
  top: "label"
  top: "bbox"
  top: "landmark"
  top: "bbox_mask"
  top: "landmark_mask"
  python_param {
    module: "layers.jfda_data_layer"
    layer: "JfdaDataLayer"
    param_str: '{'
               '  "net_type": "p",'
               '  "shuffle": true,'
               '  "is_train": false,'
               '  "face_db_name": "data/pnet_face_train",'
               '  "landmark_db_name": "data/pnet_landmark_train",'
               '  "nonface_db_name": "None",'
               '  "face_batch_size": 256,'
               '  "landmark_batch_size": 256,'
               '  "nonface_batch_size": 1024'
               '}'
  }
  include {
    phase: TRAIN
  }
}
layer {
  name: "data"
  type: "Python"
  top: "data"
  top: "label"
  top: "bbox"
  top: "landmark"
  top: "bbox_mask"
  top: "landmark_mask"
  python_param {
    module: "layers.jfda_data_layer"
    layer: "JfdaDataLayer"
    param_str: '{'
               '  "net_type": "p",'
               '  "shuffle": true,'
               '  "is_train": false,'
               '  "face_db_name": "data/pnet_face_val",'
               '  "landmark_db_name": "data/pnet_landmark_val",'
               '  "nonface_db_name": "None",'
               '  "face_batch_size": 256,'
               '  "landmark_batch_size": 256,'
               '  "nonface_batch_size": 1024'
               '}'
  }
  include {
    phase: TEST
  }
}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 10
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}

layer {
  name: "conv3"
  type: "Convolution"
  bottom: "conv2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}

# face label
layer {
  name: "face_label"
  type: "Convolution"
  bottom: "conv3"
  top: "face_label"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 2
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "face_label_flatten"
  type: "Flatten"
  bottom: "face_label"
  top: "face_label_flatten"
}
# face bbox
layer {
  name: "face_bbox"
  type: "Convolution"
  bottom: "conv3"
  top: "face_bbox"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 3
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "face_bbox_flatten"
  type: "Flatten"
  bottom: "face_bbox"
  top: "face_bbox_flatten"
}
# face landmark
layer {
  name: "face_landmark"
  type: "Convolution"
  bottom: "conv3"
  top: "face_landmark"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 10
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "face_landmark_flatten"
  type: "Flatten"
  bottom: "face_landmark"
  top: "face_landmark_flatten"
}

# mask identity
layer {
  name: "bbox_mask_identity"
  type: "MaskIdentity"
  bottom: "face_bbox_flatten"
  bottom: "bbox"
  bottom: "bbox_mask"
  top: "bbox_refined"
}
layer {
  name: "landmark_mask_identity"
  type: "MaskIdentity"
  bottom: "face_landmark_flatten"
  bottom: "landmark"
  bottom: "landmark_mask"
  top: "landmark_refined"
}

# loss
layer {
  name: "face_label_loss"
  type: "SoftmaxWithLoss"
  bottom: "face_label_flatten"
  bottom: "label"
  top: "face_loss"
  loss_weight: 1
}
layer {
  name: "face_label_accuracy"
  type: "Accuracy"
  bottom: "face_label_flatten"
  bottom: "label"
  top: "face_label_accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "face_bbox_loss"
  type: "EuclideanLoss"
  bottom: "face_bbox_flatten"
  bottom: "bbox_refined"
  top: "bbox_loss"
  loss_weight: 0.5
}
layer {
  name: "face_landmark_loss"
  type: "EuclideanLoss"
  bottom: "face_landmark_flatten"
  bottom: "landmark_refined"
  top: "landmark_loss"
  loss_weight: 0.5
}
