name: "rNet"

layer {
  name: "data"
  type: "Python"
  top: "data"
  top: "bbox_target"
  top: "landmark_target"
  top: "label"
  python_param {
    module: "layers.data_layer"
    layer: "FaceDataLayer"
  }
  include {
    phase: TRAIN
  }
}
layer {
  name: "data"
  type: "Python"
  top: "data"
  top: "bbox_target"
  top: "landmark_target"
  top: "label"
  python_param {
    module: "layers.data_layer"
    layer: "FaceDataLayer"
  }
  include {
    phase: TEST
  }
}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 28
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "prelu1"
  type: "PReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "prelu2"
  type: "PReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 2
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "prelu3"
  type: "PReLU"
  bottom: "conv3"
  top: "conv3"
}

layer {
  name: "fc"
  type: "InnerProduct"
  bottom: "conv3"
  top: "fc"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "prelu4"
  type: "PReLU"
  bottom: "fc"
  top: "fc"
}

# score
layer {
  name: "score"
  type: "InnerProduct"
  bottom: "fc"
  top: "score"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
# bbox
layer {
  name: "bbox_pred"
  type: "InnerProduct"
  bottom: "fc"
  top: "bbox_pred"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
# landmark
layer {
  name: "landmark_pred"
  type: "InnerProduct"
  bottom: "fc"
  top: "landmark_pred"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

# loss
layer {
  name: "loss"
  type: "JfdaLoss"
  bottom: "score"
  bottom: "bbox_pred"
  bottom: "landmark_pred"
  bottom: "bbox_target"
  bottom: "landmark_target"
  bottom: "label"
  top: "face_cls_loss"
  top: "bbox_reg_loss"
  top: "landmark_reg_loss"
  top: "face_cls_neg_acc"
  top: "face_cls_pos_acc"
  loss_weight: 1.0
  loss_weight: 0.5
  loss_weight: 1.0
  loss_weight: 0
  loss_weight: 0
  jfda_loss_param {
    drop_loss_rate: 0.3
  }
}
